Autodesk.Revit.DB.MaterialNode.Color
The color the material is being rendered at
Remarks:
The value may differ from the default color property of the material,
because it might have been overriden by rendering settings.
Since:
2014

Autodesk.Revit.DB.MaterialNode
This is a class represents a change of material during a model-exporting process.
Remarks:
Output nodes following this node are to be assumed using the material.
The material remains in effect until another material node is sent to the output.
Since:
2014